irrelated_knob_test/sysbench_run_1713087928.out
sysbench 1.1.0-2ca9e3f (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 30
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 30 tps: 18.95 qps: 936.76 (r/w/o: 684.36/184.56/67.84) lat (ms,95%): 719.92 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 30 tps: 77.03 qps: 1346.60 (r/w/o: 993.45/199.09/154.07) lat (ms,95%): 1149.76 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 30 tps: 6.00 qps: 224.01 (r/w/o: 169.01/43.00/12.00) lat (ms,95%): 1401.61 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 30 tps: 2.00 qps: 44.00 (r/w/o: 28.00/12.00/4.00) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 30 tps: 31.00 qps: 557.02 (r/w/o: 353.01/142.00/62.00) lat (ms,95%): 3326.55 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 30 tps: 29.00 qps: 482.99 (r/w/o: 335.00/90.00/58.00) lat (ms,95%): 3706.08 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 30 tps: 36.00 qps: 754.98 (r/w/o: 539.99/143.00/72.00) lat (ms,95%): 1453.01 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 30 tps: 10.00 qps: 322.00 (r/w/o: 228.00/74.00/20.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 30 tps: 24.00 qps: 325.01 (r/w/o: 217.01/60.00/48.00) lat (ms,95%): 2362.72 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 30 tps: 11.00 qps: 336.99 (r/w/o: 245.00/70.00/22.00) lat (ms,95%): 2082.91 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 30 tps: 21.00 qps: 330.00 (r/w/o: 227.00/61.00/42.00) lat (ms,95%): 2362.72 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 30 tps: 16.00 qps: 349.00 (r/w/o: 251.00/66.00/32.00) lat (ms,95%): 2362.72 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 30 tps: 24.00 qps: 444.99 (r/w/o: 297.99/99.00/48.00) lat (ms,95%): 2449.36 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 30 tps: 13.00 qps: 363.99 (r/w/o: 264.99/73.00/26.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 30 tps: 23.00 qps: 366.02 (r/w/o: 251.01/69.00/46.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 30 tps: 18.00 qps: 443.00 (r/w/o: 303.00/104.00/36.00) lat (ms,95%): 2493.86 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 30 tps: 27.00 qps: 417.00 (r/w/o: 299.00/64.00/54.00) lat (ms,95%): 2082.91 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 30 tps: 20.00 qps: 442.98 (r/w/o: 298.99/104.00/40.00) lat (ms,95%): 1903.57 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 30 tps: 14.00 qps: 348.00 (r/w/o: 258.00/62.00/28.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 30 tps: 24.00 qps: 412.01 (r/w/o: 283.01/81.00/48.00) lat (ms,95%): 2082.91 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 30 tps: 22.00 qps: 384.00 (r/w/o: 261.00/79.00/44.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 30 tps: 18.00 qps: 413.00 (r/w/o: 290.00/87.00/36.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 30 tps: 18.00 qps: 431.00 (r/w/o: 324.00/71.00/36.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 30 tps: 21.00 qps: 362.00 (r/w/o: 236.00/84.00/42.00) lat (ms,95%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 30 tps: 23.00 qps: 379.00 (r/w/o: 255.00/78.00/46.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 30 tps: 16.00 qps: 409.00 (r/w/o: 303.00/74.00/32.00) lat (ms,95%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 30 tps: 21.00 qps: 397.00 (r/w/o: 277.00/78.00/42.00) lat (ms,95%): 2238.47 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 30 tps: 22.00 qps: 414.00 (r/w/o: 285.00/85.00/44.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 30 tps: 15.00 qps: 387.00 (r/w/o: 268.00/89.00/30.00) lat (ms,95%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 30 tps: 25.00 qps: 401.00 (r/w/o: 286.00/65.00/50.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 30 tps: 16.00 qps: 357.00 (r/w/o: 254.00/71.00/32.00) lat (ms,95%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 30 tps: 22.00 qps: 465.00 (r/w/o: 315.00/106.00/44.00) lat (ms,95%): 2238.47 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 30 tps: 19.00 qps: 351.95 (r/w/o: 232.97/80.99/37.99) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 30 tps: 21.00 qps: 408.03 (r/w/o: 311.02/55.00/42.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 30 tps: 13.00 qps: 295.00 (r/w/o: 206.00/63.00/26.00) lat (ms,95%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 30 tps: 21.00 qps: 436.00 (r/w/o: 311.00/83.00/42.00) lat (ms,95%): 2632.28 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 30 tps: 21.00 qps: 443.00 (r/w/o: 297.00/104.00/42.00) lat (ms,95%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 30 tps: 19.00 qps: 311.02 (r/w/o: 211.01/62.00/38.00) lat (ms,95%): 2539.17 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 30 tps: 18.00 qps: 457.96 (r/w/o: 326.97/94.99/36.00) lat (ms,95%): 2320.55 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 30 tps: 19.00 qps: 316.03 (r/w/o: 207.02/71.01/38.00) lat (ms,95%): 2279.14 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 30 tps: 21.00 qps: 425.00 (r/w/o: 303.00/80.00/42.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 30 tps: 21.00 qps: 415.00 (r/w/o: 309.00/64.00/42.00) lat (ms,95%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 30 tps: 26.00 qps: 442.00 (r/w/o: 288.00/102.00/52.00) lat (ms,95%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 30 tps: 13.00 qps: 337.00 (r/w/o: 255.00/56.00/26.00) lat (ms,95%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 30 tps: 24.00 qps: 460.00 (r/w/o: 317.00/95.00/48.00) lat (ms,95%): 2238.47 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 30 tps: 22.00 qps: 379.99 (r/w/o: 245.99/90.00/44.00) lat (ms,95%): 2279.14 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 30 tps: 22.00 qps: 477.99 (r/w/o: 348.99/85.00/44.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 30 tps: 27.00 qps: 522.03 (r/w/o: 359.02/109.01/54.00) lat (ms,95%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 30 tps: 13.00 qps: 379.00 (r/w/o: 279.00/74.00/26.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 30 tps: 28.00 qps: 466.99 (r/w/o: 335.99/75.00/56.00) lat (ms,95%): 2238.47 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 30 tps: 19.00 qps: 433.01 (r/w/o: 292.01/103.00/38.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 30 tps: 20.00 qps: 425.99 (r/w/o: 303.99/82.00/40.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 30 tps: 26.00 qps: 443.01 (r/w/o: 291.01/100.00/52.00) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 30 tps: 11.00 qps: 323.99 (r/w/o: 248.99/53.00/22.00) lat (ms,95%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 30 tps: 35.00 qps: 554.02 (r/w/o: 376.01/108.00/70.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 30 tps: 12.00 qps: 379.00 (r/w/o: 250.00/105.00/24.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 30 tps: 26.00 qps: 458.98 (r/w/o: 353.99/53.00/52.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 30 tps: 28.00 qps: 504.02 (r/w/o: 328.01/120.00/56.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 30 tps: 24.00 qps: 542.00 (r/w/o: 383.00/111.00/48.00) lat (ms,95%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 30 tps: 20.00 qps: 407.99 (r/w/o: 302.99/65.00/40.00) lat (ms,95%): 1533.66 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 30 tps: 32.00 qps: 574.01 (r/w/o: 385.01/125.00/64.00) lat (ms,95%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 30 tps: 15.00 qps: 406.00 (r/w/o: 282.00/94.00/30.00) lat (ms,95%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 30 tps: 31.00 qps: 565.00 (r/w/o: 406.00/97.00/62.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 30 tps: 23.00 qps: 455.98 (r/w/o: 305.99/104.00/46.00) lat (ms,95%): 1533.66 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 30 tps: 30.00 qps: 572.02 (r/w/o: 392.01/120.00/60.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 30 tps: 22.00 qps: 538.01 (r/w/o: 404.00/90.00/44.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 30 tps: 32.00 qps: 493.00 (r/w/o: 323.00/106.00/64.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 30 tps: 9.00 qps: 313.00 (r/w/o: 242.00/53.00/18.00) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 30 tps: 30.00 qps: 461.98 (r/w/o: 305.99/96.00/60.00) lat (ms,95%): 2320.55 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 30 tps: 25.00 qps: 553.02 (r/w/o: 395.02/108.00/50.00) lat (ms,95%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 30 tps: 16.00 qps: 381.00 (r/w/o: 273.00/76.00/32.00) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 30 tps: 24.00 qps: 514.00 (r/w/o: 362.00/104.00/48.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 30 tps: 22.00 qps: 370.00 (r/w/o: 249.00/77.00/44.00) lat (ms,95%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 30 tps: 24.00 qps: 498.00 (r/w/o: 357.00/93.00/48.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 30 tps: 25.00 qps: 447.00 (r/w/o: 304.00/93.00/50.00) lat (ms,95%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 30 tps: 9.00 qps: 373.00 (r/w/o: 257.00/98.00/18.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 30 tps: 40.00 qps: 586.99 (r/w/o: 421.00/86.00/80.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 30 tps: 17.00 qps: 390.00 (r/w/o: 282.00/74.00/34.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 30 tps: 21.00 qps: 408.00 (r/w/o: 272.00/94.00/42.00) lat (ms,95%): 2238.47 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 30 tps: 27.00 qps: 489.00 (r/w/o: 328.00/107.00/54.00) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 81s ] thds: 30 tps: 20.00 qps: 527.00 (r/w/o: 392.00/95.00/40.00) lat (ms,95%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 82s ] thds: 30 tps: 29.00 qps: 547.98 (r/w/o: 384.99/105.00/58.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 83s ] thds: 30 tps: 20.00 qps: 428.02 (r/w/o: 278.01/110.00/40.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 84s ] thds: 30 tps: 26.00 qps: 461.00 (r/w/o: 328.00/81.00/52.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 30 tps: 23.00 qps: 448.00 (r/w/o: 317.00/85.00/46.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 86s ] thds: 30 tps: 29.00 qps: 566.00 (r/w/o: 398.00/110.00/58.00) lat (ms,95%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 87s ] thds: 30 tps: 21.00 qps: 458.00 (r/w/o: 334.00/82.00/42.00) lat (ms,95%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 88s ] thds: 30 tps: 28.00 qps: 567.99 (r/w/o: 395.99/116.00/56.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 89s ] thds: 30 tps: 30.00 qps: 521.00 (r/w/o: 356.00/105.00/60.00) lat (ms,95%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 30 tps: 13.00 qps: 355.97 (r/w/o: 242.98/86.99/26.00) lat (ms,95%): 1376.60 err/s: 0.00 reconn/s: 0.00
[ 91s ] thds: 30 tps: 33.00 qps: 637.06 (r/w/o: 452.04/119.01/66.01) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 92s ] thds: 30 tps: 26.00 qps: 629.00 (r/w/o: 432.00/145.00/52.00) lat (ms,95%): 1453.01 err/s: 0.00 reconn/s: 0.00
[ 93s ] thds: 30 tps: 24.00 qps: 402.00 (r/w/o: 300.00/54.00/48.00) lat (ms,95%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 94s ] thds: 30 tps: 6.00 qps: 250.99 (r/w/o: 140.99/98.00/12.00) lat (ms,95%): 1258.08 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 30 tps: 33.00 qps: 566.02 (r/w/o: 419.01/81.00/66.00) lat (ms,95%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 96s ] thds: 30 tps: 29.00 qps: 546.00 (r/w/o: 396.00/92.00/58.00) lat (ms,95%): 1453.01 err/s: 0.00 reconn/s: 0.00
[ 97s ] thds: 30 tps: 23.00 qps: 442.99 (r/w/o: 282.99/114.00/46.00) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 98s ] thds: 30 tps: 24.00 qps: 434.01 (r/w/o: 322.01/64.00/48.00) lat (ms,95%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 99s ] thds: 30 tps: 29.00 qps: 545.00 (r/w/o: 370.00/117.00/58.00) lat (ms,95%): 1903.57 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 30 tps: 35.00 qps: 541.00 (r/w/o: 342.00/129.00/70.00) lat (ms,95%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 101s ] thds: 30 tps: 8.00 qps: 395.99 (r/w/o: 327.99/52.00/16.00) lat (ms,95%): 1427.08 err/s: 0.00 reconn/s: 0.00
[ 102s ] thds: 30 tps: 30.00 qps: 603.02 (r/w/o: 411.01/132.00/60.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 103s ] thds: 30 tps: 23.00 qps: 459.00 (r/w/o: 326.00/87.00/46.00) lat (ms,95%): 2082.91 err/s: 0.00 reconn/s: 0.00
[ 104s ] thds: 30 tps: 27.00 qps: 418.00 (r/w/o: 279.00/85.00/54.00) lat (ms,95%): 1903.57 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 30 tps: 12.00 qps: 466.00 (r/w/o: 332.00/110.00/24.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 106s ] thds: 30 tps: 30.00 qps: 404.00 (r/w/o: 284.00/60.00/60.00) lat (ms,95%): 2405.65 err/s: 0.00 reconn/s: 0.00
[ 107s ] thds: 30 tps: 27.00 qps: 588.00 (r/w/o: 413.00/121.00/54.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 108s ] thds: 30 tps: 9.00 qps: 378.00 (r/w/o: 252.00/108.00/18.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 109s ] thds: 30 tps: 34.00 qps: 564.00 (r/w/o: 419.00/77.00/68.00) lat (ms,95%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 30 tps: 24.00 qps: 329.00 (r/w/o: 218.00/63.00/48.00) lat (ms,95%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 111s ] thds: 30 tps: 27.00 qps: 573.00 (r/w/o: 412.00/107.00/54.00) lat (ms,95%): 2405.65 err/s: 0.00 reconn/s: 0.00
[ 112s ] thds: 30 tps: 25.00 qps: 479.00 (r/w/o: 316.00/113.00/50.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 113s ] thds: 30 tps: 28.00 qps: 560.00 (r/w/o: 399.00/105.00/56.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 114s ] thds: 30 tps: 25.00 qps: 492.00 (r/w/o: 332.00/110.00/50.00) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 30 tps: 16.00 qps: 461.87 (r/w/o: 342.90/86.98/31.99) lat (ms,95%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 116s ] thds: 30 tps: 27.01 qps: 484.13 (r/w/o: 344.10/86.02/54.01) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 117s ] thds: 30 tps: 27.00 qps: 578.01 (r/w/o: 387.00/137.00/54.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 118s ] thds: 30 tps: 28.00 qps: 521.00 (r/w/o: 365.00/100.00/56.00) lat (ms,95%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 119s ] thds: 30 tps: 24.00 qps: 462.00 (r/w/o: 336.00/78.00/48.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 30 tps: 35.00 qps: 640.00 (r/w/o: 409.00/161.00/70.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 121s ] thds: 30 tps: 16.00 qps: 417.00 (r/w/o: 345.00/40.00/32.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 122s ] thds: 30 tps: 34.00 qps: 603.01 (r/w/o: 405.00/130.00/68.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 123s ] thds: 30 tps: 33.00 qps: 732.00 (r/w/o: 517.00/149.00/66.00) lat (ms,95%): 1213.57 err/s: 0.00 reconn/s: 0.00
[ 124s ] thds: 30 tps: 25.00 qps: 510.00 (r/w/o: 348.00/112.00/50.00) lat (ms,95%): 1533.66 err/s: 0.00 reconn/s: 0.00
[ 125s ] thds: 30 tps: 23.00 qps: 478.99 (r/w/o: 346.99/86.00/46.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 126s ] thds: 30 tps: 34.00 qps: 637.02 (r/w/o: 450.01/119.00/68.00) lat (ms,95%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 127s ] thds: 30 tps: 25.00 qps: 498.00 (r/w/o: 341.00/107.00/50.00) lat (ms,95%): 1352.03 err/s: 0.00 reconn/s: 0.00
[ 128s ] thds: 30 tps: 28.00 qps: 531.99 (r/w/o: 353.00/123.00/56.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 129s ] thds: 30 tps: 27.00 qps: 536.01 (r/w/o: 384.00/98.00/54.00) lat (ms,95%): 1561.52 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 30 tps: 28.00 qps: 539.00 (r/w/o: 383.00/100.00/56.00) lat (ms,95%): 1533.66 err/s: 0.00 reconn/s: 0.00
[ 131s ] thds: 30 tps: 24.00 qps: 508.00 (r/w/o: 341.00/119.00/48.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 132s ] thds: 30 tps: 19.00 qps: 446.00 (r/w/o: 341.00/67.00/38.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 133s ] thds: 30 tps: 26.00 qps: 487.00 (r/w/o: 332.00/103.00/52.00) lat (ms,95%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 134s ] thds: 30 tps: 29.00 qps: 555.00 (r/w/o: 388.00/109.00/58.00) lat (ms,95%): 2082.91 err/s: 0.00 reconn/s: 0.00
[ 135s ] thds: 30 tps: 21.00 qps: 458.00 (r/w/o: 313.00/103.00/42.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 136s ] thds: 30 tps: 11.00 qps: 395.00 (r/w/o: 257.00/116.00/22.00) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 137s ] thds: 30 tps: 34.00 qps: 494.00 (r/w/o: 378.00/48.00/68.00) lat (ms,95%): 2279.14 err/s: 0.00 reconn/s: 0.00
[ 138s ] thds: 30 tps: 28.00 qps: 501.00 (r/w/o: 345.00/100.00/56.00) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 139s ] thds: 30 tps: 23.00 qps: 543.00 (r/w/o: 392.00/105.00/46.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 30 tps: 26.00 qps: 477.00 (r/w/o: 322.00/103.00/52.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 141s ] thds: 30 tps: 31.00 qps: 584.00 (r/w/o: 402.00/120.00/62.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 142s ] thds: 30 tps: 28.00 qps: 516.99 (r/w/o: 344.99/116.00/56.00) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 143s ] thds: 30 tps: 13.00 qps: 491.02 (r/w/o: 360.01/105.00/26.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 144s ] thds: 30 tps: 34.00 qps: 504.98 (r/w/o: 369.98/67.00/68.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 145s ] thds: 30 tps: 20.00 qps: 491.02 (r/w/o: 366.02/85.00/40.00) lat (ms,95%): 1352.03 err/s: 0.00 reconn/s: 0.00
[ 146s ] thds: 30 tps: 10.00 qps: 217.00 (r/w/o: 103.00/94.00/20.00) lat (ms,95%): 2362.72 err/s: 0.00 reconn/s: 0.00
[ 147s ] thds: 30 tps: 31.00 qps: 519.00 (r/w/o: 367.00/90.00/62.00) lat (ms,95%): 3267.19 err/s: 0.00 reconn/s: 0.00
[ 148s ] thds: 30 tps: 21.00 qps: 417.99 (r/w/o: 303.99/72.00/42.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 149s ] thds: 30 tps: 32.00 qps: 599.99 (r/w/o: 401.99/134.00/64.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 30 tps: 27.00 qps: 524.02 (r/w/o: 381.02/89.00/54.00) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 151s ] thds: 30 tps: 25.00 qps: 558.00 (r/w/o: 397.00/111.00/50.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 152s ] thds: 30 tps: 29.00 qps: 560.00 (r/w/o: 382.00/120.00/58.00) lat (ms,95%): 2082.91 err/s: 0.00 reconn/s: 0.00
[ 153s ] thds: 30 tps: 25.00 qps: 483.00 (r/w/o: 349.00/84.00/50.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 154s ] thds: 30 tps: 21.00 qps: 568.00 (r/w/o: 394.00/132.00/42.00) lat (ms,95%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 155s ] thds: 30 tps: 33.00 qps: 559.00 (r/w/o: 384.00/109.00/66.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 156s ] thds: 30 tps: 25.00 qps: 504.00 (r/w/o: 361.00/93.00/50.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 157s ] thds: 30 tps: 21.00 qps: 405.00 (r/w/o: 274.00/89.00/42.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 158s ] thds: 30 tps: 21.00 qps: 516.00 (r/w/o: 382.00/92.00/42.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 159s ] thds: 30 tps: 30.00 qps: 481.00 (r/w/o: 316.00/105.00/60.00) lat (ms,95%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 30 tps: 29.00 qps: 463.00 (r/w/o: 305.00/100.00/58.00) lat (ms,95%): 2362.72 err/s: 0.00 reconn/s: 0.00
[ 161s ] thds: 30 tps: 5.00 qps: 375.00 (r/w/o: 301.00/64.00/10.00) lat (ms,95%): 1533.66 err/s: 0.00 reconn/s: 0.00
[ 162s ] thds: 30 tps: 39.00 qps: 626.00 (r/w/o: 431.00/117.00/78.00) lat (ms,95%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 163s ] thds: 30 tps: 22.00 qps: 428.00 (r/w/o: 280.00/104.00/44.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 164s ] thds: 30 tps: 23.00 qps: 611.99 (r/w/o: 437.00/129.00/46.00) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 165s ] thds: 30 tps: 30.00 qps: 516.00 (r/w/o: 372.00/84.00/60.00) lat (ms,95%): 1453.01 err/s: 0.00 reconn/s: 0.00
[ 166s ] thds: 30 tps: 32.00 qps: 613.00 (r/w/o: 397.00/152.00/64.00) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 167s ] thds: 30 tps: 28.00 qps: 667.00 (r/w/o: 490.00/121.00/56.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 168s ] thds: 30 tps: 24.00 qps: 431.00 (r/w/o: 332.00/51.00/48.00) lat (ms,95%): 1453.01 err/s: 0.00 reconn/s: 0.00
[ 169s ] thds: 30 tps: 39.00 qps: 689.00 (r/w/o: 466.00/145.00/78.00) lat (ms,95%): 1453.01 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 30 tps: 29.00 qps: 607.00 (r/w/o: 419.00/130.00/58.00) lat (ms,95%): 1427.08 err/s: 0.00 reconn/s: 0.00
[ 171s ] thds: 30 tps: 23.00 qps: 499.00 (r/w/o: 344.00/109.00/46.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 172s ] thds: 30 tps: 27.00 qps: 478.00 (r/w/o: 333.00/91.00/54.00) lat (ms,95%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 173s ] thds: 30 tps: 19.00 qps: 497.00 (r/w/o: 387.00/72.00/38.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 174s ] thds: 30 tps: 27.00 qps: 452.00 (r/w/o: 275.00/123.00/54.00) lat (ms,95%): 2585.31 err/s: 0.00 reconn/s: 0.00
[ 175s ] thds: 30 tps: 23.00 qps: 506.00 (r/w/o: 365.00/95.00/46.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 176s ] thds: 30 tps: 32.00 qps: 536.99 (r/w/o: 362.99/110.00/64.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 177s ] thds: 30 tps: 21.00 qps: 581.01 (r/w/o: 401.01/138.00/42.00) lat (ms,95%): 1258.08 err/s: 0.00 reconn/s: 0.00
[ 178s ] thds: 30 tps: 36.00 qps: 546.00 (r/w/o: 386.00/88.00/72.00) lat (ms,95%): 1561.52 err/s: 0.00 reconn/s: 0.00
[ 179s ] thds: 30 tps: 21.00 qps: 495.00 (r/w/o: 367.00/86.00/42.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 30 tps: 21.00 qps: 529.92 (r/w/o: 350.95/136.98/41.99) lat (ms,95%): 1903.57 err/s: 0.00 reconn/s: 0.00
[ 181s ] thds: 30 tps: 19.00 qps: 374.06 (r/w/o: 322.05/14.00/38.01) lat (ms,95%): 1903.57 err/s: 0.00 reconn/s: 0.00
[ 182s ] thds: 30 tps: 32.00 qps: 500.94 (r/w/o: 292.97/143.98/63.99) lat (ms,95%): 2405.65 err/s: 0.00 reconn/s: 0.00
[ 183s ] thds: 30 tps: 19.00 qps: 571.05 (r/w/o: 401.03/132.01/38.00) lat (ms,95%): 1327.91 err/s: 0.00 reconn/s: 0.00
[ 184s ] thds: 30 tps: 31.00 qps: 502.02 (r/w/o: 361.01/79.00/62.00) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 185s ] thds: 30 tps: 25.00 qps: 506.00 (r/w/o: 326.00/130.00/50.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 186s ] thds: 30 tps: 25.00 qps: 493.98 (r/w/o: 366.99/77.00/50.00) lat (ms,95%): 2405.65 err/s: 0.00 reconn/s: 0.00
[ 187s ] thds: 30 tps: 33.00 qps: 618.93 (r/w/o: 429.95/122.99/65.99) lat (ms,95%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 188s ] thds: 30 tps: 25.00 qps: 569.08 (r/w/o: 411.06/108.02/50.01) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 189s ] thds: 30 tps: 32.00 qps: 565.00 (r/w/o: 388.00/113.00/64.00) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 30 tps: 20.00 qps: 546.00 (r/w/o: 374.00/132.00/40.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 191s ] thds: 30 tps: 35.00 qps: 579.00 (r/w/o: 420.00/89.00/70.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 192s ] thds: 30 tps: 29.00 qps: 570.00 (r/w/o: 398.00/114.00/58.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 193s ] thds: 30 tps: 21.00 qps: 469.98 (r/w/o: 324.99/103.00/42.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 194s ] thds: 30 tps: 30.00 qps: 493.04 (r/w/o: 338.03/95.01/60.00) lat (ms,95%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 195s ] thds: 30 tps: 23.00 qps: 612.98 (r/w/o: 430.99/136.00/46.00) lat (ms,95%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 196s ] thds: 30 tps: 35.00 qps: 603.00 (r/w/o: 421.00/112.00/70.00) lat (ms,95%): 1533.66 err/s: 0.00 reconn/s: 0.00
[ 197s ] thds: 30 tps: 22.00 qps: 536.99 (r/w/o: 380.99/112.00/44.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 198s ] thds: 30 tps: 36.00 qps: 572.00 (r/w/o: 397.00/103.00/72.00) lat (ms,95%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 199s ] thds: 30 tps: 22.00 qps: 569.02 (r/w/o: 407.01/118.00/44.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 30 tps: 26.99 qps: 516.85 (r/w/o: 361.90/100.97/53.98) lat (ms,95%): 1903.57 err/s: 0.00 reconn/s: 0.00
[ 201s ] thds: 30 tps: 25.00 qps: 485.06 (r/w/o: 341.04/94.01/50.01) lat (ms,95%): 2082.91 err/s: 0.00 reconn/s: 0.00
[ 202s ] thds: 30 tps: 32.00 qps: 624.10 (r/w/o: 435.07/125.02/64.01) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 203s ] thds: 30 tps: 25.00 qps: 475.00 (r/w/o: 331.00/94.00/50.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 204s ] thds: 30 tps: 26.00 qps: 487.00 (r/w/o: 334.00/101.00/52.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 205s ] thds: 30 tps: 24.00 qps: 507.00 (r/w/o: 370.00/89.00/48.00) lat (ms,95%): 1561.52 err/s: 0.00 reconn/s: 0.00
[ 206s ] thds: 30 tps: 15.00 qps: 439.00 (r/w/o: 283.00/126.00/30.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 207s ] thds: 30 tps: 26.00 qps: 473.91 (r/w/o: 360.93/60.99/51.99) lat (ms,95%): 2493.86 err/s: 0.00 reconn/s: 0.00
[ 208s ] thds: 30 tps: 26.00 qps: 318.06 (r/w/o: 185.03/81.02/52.01) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 209s ] thds: 30 tps: 22.00 qps: 544.93 (r/w/o: 397.95/102.99/43.99) lat (ms,95%): 2279.14 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 30 tps: 29.00 qps: 575.00 (r/w/o: 420.00/97.00/58.00) lat (ms,95%): 2238.47 err/s: 0.00 reconn/s: 0.00
[ 211s ] thds: 30 tps: 32.00 qps: 541.08 (r/w/o: 352.05/125.02/64.01) lat (ms,95%): 1191.92 err/s: 0.00 reconn/s: 0.00
[ 212s ] thds: 30 tps: 26.00 qps: 524.00 (r/w/o: 357.00/115.00/52.00) lat (ms,95%): 1903.57 err/s: 0.00 reconn/s: 0.00
[ 213s ] thds: 30 tps: 26.00 qps: 638.00 (r/w/o: 468.00/118.00/52.00) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 214s ] thds: 30 tps: 32.00 qps: 627.00 (r/w/o: 449.00/114.00/64.00) lat (ms,95%): 1235.62 err/s: 0.00 reconn/s: 0.00
[ 215s ] thds: 30 tps: 32.00 qps: 585.00 (r/w/o: 394.00/127.00/64.00) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 216s ] thds: 30 tps: 24.00 qps: 515.00 (r/w/o: 357.00/110.00/48.00) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 217s ] thds: 30 tps: 22.00 qps: 468.99 (r/w/o: 338.99/86.00/44.00) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 218s ] thds: 30 tps: 35.00 qps: 638.02 (r/w/o: 444.01/124.00/70.00) lat (ms,95%): 1533.66 err/s: 0.00 reconn/s: 0.00
[ 219s ] thds: 30 tps: 32.00 qps: 687.00 (r/w/o: 480.00/143.00/64.00) lat (ms,95%): 1352.03 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 30 tps: 24.00 qps: 505.00 (r/w/o: 363.00/94.00/48.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 221s ] thds: 30 tps: 25.00 qps: 578.91 (r/w/o: 396.94/131.98/49.99) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 222s ] thds: 30 tps: 31.01 qps: 574.10 (r/w/o: 413.07/99.02/62.01) lat (ms,95%): 1376.60 err/s: 0.00 reconn/s: 0.00
[ 223s ] thds: 30 tps: 35.00 qps: 565.98 (r/w/o: 377.99/118.00/70.00) lat (ms,95%): 1533.66 err/s: 0.00 reconn/s: 0.00
[ 224s ] thds: 30 tps: 26.00 qps: 580.92 (r/w/o: 407.94/120.98/51.99) lat (ms,95%): 1327.91 err/s: 0.00 reconn/s: 0.00
[ 225s ] thds: 30 tps: 26.00 qps: 597.00 (r/w/o: 443.00/102.00/52.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 226s ] thds: 30 tps: 35.00 qps: 600.00 (r/w/o: 400.00/130.00/70.00) lat (ms,95%): 1427.08 err/s: 0.00 reconn/s: 0.00
[ 227s ] thds: 30 tps: 28.00 qps: 550.99 (r/w/o: 363.99/131.00/56.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 228s ] thds: 30 tps: 31.01 qps: 676.13 (r/w/o: 499.10/115.02/62.01) lat (ms,95%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 229s ] thds: 30 tps: 30.00 qps: 639.00 (r/w/o: 461.00/118.00/60.00) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 30 tps: 31.00 qps: 578.98 (r/w/o: 399.99/117.00/62.00) lat (ms,95%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 231s ] thds: 30 tps: 29.00 qps: 447.01 (r/w/o: 284.00/105.00/58.00) lat (ms,95%): 1533.66 err/s: 0.00 reconn/s: 0.00
[ 232s ] thds: 30 tps: 5.00 qps: 330.01 (r/w/o: 291.01/29.00/10.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 233s ] thds: 30 tps: 28.00 qps: 319.00 (r/w/o: 144.00/119.00/56.00) lat (ms,95%): 2279.14 err/s: 0.00 reconn/s: 0.00
[ 234s ] thds: 30 tps: 19.00 qps: 516.00 (r/w/o: 396.00/82.00/38.00) lat (ms,95%): 2362.72 err/s: 0.00 reconn/s: 0.00
[ 235s ] thds: 30 tps: 31.00 qps: 633.00 (r/w/o: 460.00/111.00/62.00) lat (ms,95%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 236s ] thds: 30 tps: 27.00 qps: 610.98 (r/w/o: 406.99/150.00/54.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 237s ] thds: 30 tps: 22.00 qps: 209.01 (r/w/o: 120.00/45.00/44.00) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 238s ] thds: 30 tps: 5.00 qps: 330.99 (r/w/o: 267.99/53.00/10.00) lat (ms,95%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 239s ] thds: 30 tps: 16.00 qps: 192.00 (r/w/o: 114.00/46.00/32.00) lat (ms,95%): 2778.39 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 30 tps: 17.00 qps: 429.01 (r/w/o: 314.01/81.00/34.00) lat (ms,95%): 3448.53 err/s: 0.00 reconn/s: 0.00
[ 241s ] thds: 30 tps: 26.00 qps: 548.98 (r/w/o: 390.99/106.00/52.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 242s ] thds: 30 tps: 30.00 qps: 521.00 (r/w/o: 362.00/99.00/60.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 243s ] thds: 30 tps: 29.00 qps: 596.02 (r/w/o: 418.01/120.00/58.00) lat (ms,95%): 1258.08 err/s: 0.00 reconn/s: 0.00
[ 244s ] thds: 30 tps: 33.00 qps: 661.99 (r/w/o: 461.99/134.00/66.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 245s ] thds: 30 tps: 28.00 qps: 543.00 (r/w/o: 388.00/99.00/56.00) lat (ms,95%): 1427.08 err/s: 0.00 reconn/s: 0.00
[ 246s ] thds: 30 tps: 27.00 qps: 556.02 (r/w/o: 392.01/110.00/54.00) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 247s ] thds: 30 tps: 29.00 qps: 558.00 (r/w/o: 371.00/129.00/58.00) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 248s ] thds: 30 tps: 26.00 qps: 559.00 (r/w/o: 404.00/103.00/52.00) lat (ms,95%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 249s ] thds: 30 tps: 32.00 qps: 603.00 (r/w/o: 420.00/119.00/64.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 30 tps: 27.00 qps: 512.00 (r/w/o: 348.00/110.00/54.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 251s ] thds: 30 tps: 30.00 qps: 605.01 (r/w/o: 432.00/113.00/60.00) lat (ms,95%): 2082.91 err/s: 0.00 reconn/s: 0.00
[ 252s ] thds: 30 tps: 20.00 qps: 435.00 (r/w/o: 303.00/92.00/40.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 253s ] thds: 30 tps: 33.00 qps: 639.00 (r/w/o: 453.00/120.00/66.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 254s ] thds: 30 tps: 29.00 qps: 504.00 (r/w/o: 332.00/114.00/58.00) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 255s ] thds: 30 tps: 19.00 qps: 482.00 (r/w/o: 360.00/84.00/38.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 256s ] thds: 30 tps: 31.00 qps: 565.00 (r/w/o: 382.00/121.00/62.00) lat (ms,95%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 257s ] thds: 30 tps: 25.00 qps: 545.99 (r/w/o: 389.00/107.00/50.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 258s ] thds: 30 tps: 26.00 qps: 500.99 (r/w/o: 350.99/98.00/52.00) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 259s ] thds: 30 tps: 30.00 qps: 580.02 (r/w/o: 402.01/118.00/60.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 30 tps: 21.00 qps: 525.98 (r/w/o: 389.99/94.00/42.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 261s ] thds: 30 tps: 37.00 qps: 699.98 (r/w/o: 475.99/150.00/74.00) lat (ms,95%): 1427.08 err/s: 0.00 reconn/s: 0.00
[ 262s ] thds: 30 tps: 35.00 qps: 633.03 (r/w/o: 435.02/128.01/70.00) lat (ms,95%): 1258.08 err/s: 0.00 reconn/s: 0.00
[ 263s ] thds: 30 tps: 24.00 qps: 560.00 (r/w/o: 403.00/109.00/48.00) lat (ms,95%): 1327.91 err/s: 0.00 reconn/s: 0.00
[ 264s ] thds: 30 tps: 30.00 qps: 525.00 (r/w/o: 350.00/115.00/60.00) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 265s ] thds: 30 tps: 32.00 qps: 683.98 (r/w/o: 483.98/136.00/64.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 266s ] thds: 30 tps: 28.00 qps: 536.00 (r/w/o: 381.00/99.00/56.00) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 267s ] thds: 30 tps: 33.00 qps: 651.02 (r/w/o: 463.01/122.00/66.00) lat (ms,95%): 1280.93 err/s: 0.00 reconn/s: 0.00
[ 268s ] thds: 30 tps: 26.00 qps: 630.00 (r/w/o: 448.00/130.00/52.00) lat (ms,95%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 269s ] thds: 30 tps: 34.00 qps: 553.00 (r/w/o: 375.00/110.00/68.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 30 tps: 13.00 qps: 442.99 (r/w/o: 296.99/120.00/26.00) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 271s ] thds: 30 tps: 38.00 qps: 648.02 (r/w/o: 479.01/93.00/76.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 272s ] thds: 30 tps: 30.00 qps: 541.98 (r/w/o: 367.99/114.00/60.00) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 273s ] thds: 30 tps: 21.00 qps: 543.02 (r/w/o: 385.01/116.00/42.00) lat (ms,95%): 1561.52 err/s: 0.00 reconn/s: 0.00
[ 274s ] thds: 30 tps: 27.00 qps: 494.00 (r/w/o: 333.00/107.00/54.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 275s ] thds: 30 tps: 30.00 qps: 533.99 (r/w/o: 370.99/103.00/60.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 276s ] thds: 30 tps: 26.00 qps: 538.00 (r/w/o: 391.00/95.00/52.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 277s ] thds: 30 tps: 24.00 qps: 512.01 (r/w/o: 349.01/115.00/48.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 278s ] thds: 30 tps: 29.00 qps: 528.98 (r/w/o: 375.99/95.00/58.00) lat (ms,95%): 1903.57 err/s: 0.00 reconn/s: 0.00
[ 279s ] thds: 30 tps: 24.00 qps: 571.03 (r/w/o: 398.02/125.01/48.00) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 30 tps: 34.00 qps: 577.96 (r/w/o: 397.97/111.99/68.00) lat (ms,95%): 1903.57 err/s: 0.00 reconn/s: 0.00
[ 281s ] thds: 30 tps: 29.00 qps: 615.00 (r/w/o: 448.00/109.00/58.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 282s ] thds: 30 tps: 29.00 qps: 561.00 (r/w/o: 384.00/119.00/58.00) lat (ms,95%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 283s ] thds: 30 tps: 24.00 qps: 538.00 (r/w/o: 370.00/120.00/48.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 284s ] thds: 30 tps: 36.00 qps: 687.05 (r/w/o: 493.03/122.01/72.01) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 285s ] thds: 30 tps: 31.00 qps: 570.00 (r/w/o: 397.00/111.00/62.00) lat (ms,95%): 1427.08 err/s: 0.00 reconn/s: 0.00
[ 286s ] thds: 30 tps: 19.00 qps: 464.00 (r/w/o: 301.00/125.00/38.00) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 287s ] thds: 30 tps: 28.00 qps: 566.00 (r/w/o: 424.00/86.00/56.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 288s ] thds: 30 tps: 27.00 qps: 541.00 (r/w/o: 364.00/123.00/54.00) lat (ms,95%): 2082.91 err/s: 0.00 reconn/s: 0.00
[ 289s ] thds: 30 tps: 27.00 qps: 517.00 (r/w/o: 372.00/91.00/54.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 30 tps: 30.00 qps: 557.00 (r/w/o: 376.00/121.00/60.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 291s ] thds: 30 tps: 24.00 qps: 490.00 (r/w/o: 354.00/88.00/48.00) lat (ms,95%): 1533.66 err/s: 0.00 reconn/s: 0.00
[ 292s ] thds: 30 tps: 27.00 qps: 492.00 (r/w/o: 326.00/112.00/54.00) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 293s ] thds: 30 tps: 9.00 qps: 417.99 (r/w/o: 291.99/108.00/18.00) lat (ms,95%): 2449.36 err/s: 0.00 reconn/s: 0.00
[ 294s ] thds: 30 tps: 40.00 qps: 608.02 (r/w/o: 450.01/78.00/80.00) lat (ms,95%): 1561.52 err/s: 0.00 reconn/s: 0.00
[ 295s ] thds: 30 tps: 29.00 qps: 606.98 (r/w/o: 431.98/117.00/58.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 296s ] thds: 30 tps: 23.00 qps: 509.02 (r/w/o: 342.01/121.00/46.00) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 297s ] thds: 30 tps: 26.00 qps: 513.99 (r/w/o: 350.00/112.00/52.00) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 298s ] thds: 30 tps: 29.00 qps: 603.00 (r/w/o: 423.00/122.00/58.00) lat (ms,95%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 299s ] thds: 30 tps: 35.00 qps: 632.00 (r/w/o: 461.00/101.00/70.00) lat (ms,95%): 1304.21 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 30 tps: 32.00 qps: 617.98 (r/w/o: 423.99/130.00/64.00) lat (ms,95%): 1327.91 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            105812
        write:                           30232
        other:                           15116
        total:                           151160
    transactions:                        7558   (25.11 per sec.)
    queries:                             151160 (502.19 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      25.1097
    time elapsed:                        300.9995s
    total number of events:              7558

Latency (ms):
         min:                                   17.27
         avg:                                 1192.92
         max:                                 3735.09
         95th percentile:                     2009.23
         sum:                              9016089.42

Threads fairness:
    events (avg/stddev):           251.9333/5.58
    execution time (avg/stddev):   300.5363/0.26